#Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
#Пример:o для k = 8 список будет выглядеть так: 
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]
# формула:F−1 = 1, F−2 = -1,Fn = F(n+2)−F(n+1).F−n = (−1)n+1Fn

f = 8
f1 = 0
f2 = 1
if f <= 0:
    print ("Число должно быть > 0: ")
elif f == 1:
    print(f1)
elif f == 2:
    print(f2)
else:
    print(0, 1, end=' ')
    for i in range(2, f):
        f1, f2 = f2, f1 + f2
        print(f2, end=' ')

if f == 1:
    print (1) 
elif f == 2:                       
    print (-1)
else:
        f1, f2 = 1, -1
        for i in range(2, f):
            f1, f2 = f2, f1 - f2
print (f2)

