print ('Часть 1:')

prog_1= ['разработка', 'сокет', 'декоратор']

for i in prog_1:
    
    print ('Tип переменной:{}'.format(type(i)))
    print('Cодержание переменной - {}'.format(i))
    print()
    

# с помощью онлайн-конвертера преобразуем в набор кодовых точек Unicode

print ('Часть 2:')

prog_2 = ['\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430',
          '\u0441\u043e\u043a\u0435\u0442',
          '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440']

for i in prog_2:
    
    print ('Tип переменной:{}'.format(type(i)))
    print('Cодержание переменной - {}'.format(i))
    print()
    